#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# @author: CeresBebop
# @desc: 求车速

if __name__ == "__main__":
    a = [0, 0, 0, 0, 0] # 列表a用来存放分解后的5个数字
    # i为里程数初始值，因最后结果仍是5位数，故最大值为100000
    for i in range(95860, 100000):
        # 从高到低分解当前i中保存的5位数，并顺次存放在数组元素a[0]~a[4]中
        t = 0
        k = 100000
        while k >= 10:
            a[t] = (i % k)//(k // 10) # 保存分解后的数字
            k /= 10
            t += 1
        if a[0] == a[4] and a[1] == a[3]:
            print("里程表上出现的新的对称数为: %d%d%d%d%d" % (a[0], a[1], a[2], a[3], a[4]))
            print("该车的速度为: %.2f" % ((i-95859)/2.0))
            break # 跳出循环

